xmlDados.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Body>
      <ns1:CONSULTA_PROCESSAMENTO_REMESSA_TITULO xmlns:ns1="urn:server.CONSULTA_PROCESSAMENTO_REMESSA_TITULO" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <Servico href="#id0" />
      </ns1:CONSULTA_PROCESSAMENTO_REMESSA_TITULO>
      <multiRef xmlns:ns2="urn:server.NetSupremaConsultaProcessamento" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" id="id0" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns2:ServicoConsultaProcessamentoRemessa">
         <Autenticacao href="#id1" />
         <DadosConsulta href="#id2" />
         <RetornoProcessamento href="#id3" />
      </multiRef>
      <multiRef xmlns:ns3="urn:server.NetSupremaConsultaProcessamento" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" id="id2" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns3:DadosConsulta">
         <CODIGO_CEDENTE xsi:type="xsd:string">10971</CODIGO_CEDENTE>
         <CODIGO_CEDENTE_DV xsi:type="xsd:string">1</CODIGO_CEDENTE_DV>
         <CONTA_CORRENTE xsi:type="xsd:string">51557</CONTA_CORRENTE>
         <CONTA_CORRENTE_DV xsi:type="xsd:string">4</CONTA_CORRENTE_DV>
         <CODIGO_LOTE_AGENDAMENTO xsi:type="xsd:string">10868</CODIGO_LOTE_AGENDAMENTO>
      </multiRef>
      <multiRef xmlns:ns4="urn:server.NetSupremaConsultaProcessamento" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" id="id3" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns4:RetornoProcessamento">
         <SITUACAO xsi:type="xsd:string" />
         <DETALHE_SITUACAO xsi:type="xsd:string" />
         <LOG_PROCESSAMENTO xsi:type="xsd:string" />
         <DHPROCESSAMENTO xsi:type="xsd:string" />
      </multiRef>
      <multiRef xmlns:ns5="urn:server.NetSupremaConsultaProcessamento" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" id="id1" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns5:Autenticacao">
         <USUARIO xsi:type="xsd:string">BELOMONTE_WEBSERVICE</USUARIO>
         <SENHA_MD5 xsi:type="xsd:string">28a4fb4c09237e95f95312a0409f499e</SENHA_MD5>
      </multiRef>
   </soapenv:Body>
</soapenv:Envelope>
